{
  "defaultFacility": "FABRIC",
  "facilityOptions": [
    { "_id": 1, "name": "FABRIC"}
  ],
  "knowledgeBaseLink": "https://learn.fabric-testbed.net/",
  "knowledgeBaseFAQLink": "https://learn.fabric-testbed.net/faq/",
  "knowledgeBaseForumLink": "https://learn.fabric-testbed.net/forums/",
  "fabricWebsiteLink": "https://fabric-testbed.net/",
  "fabricTwitterLink": "https://twitter.com/FABRICtestbed",
  "fabricGithubLink": "https://github.com/fabric-testbed",
  "fabricYoutubeLink": "http://bit.ly/FABRICYouTube",
  "jupyterHubLinkAlpha": "https://jupyter-beta.fabric-testbed.net/",
  "jupyterHubLinkBeta": "https://jupyter-beta.fabric-testbed.net/",
  "jupyterHubLinkProduction": "https://jupyter.fabric-testbed.net/",
  "guideToGenerateFabricCompliantKey": "https://learn.fabric-testbed.net/knowledge-base/logging-into-fabric-vms/",
  "guideToLoginToFabricVMs": "https://learn.fabric-testbed.net/knowledge-base/logging-into-fabric-vms/",
  "projectLeadRequest": {
    "id": "request-project-lead-modal",
    "title": "Request to be Project Lead",
    "link": "https://registry-test.cilogon.org/registry/co_petitions/start/coef:570",
    "content": "<p>Dear Experimenter,</p><p> You are about to request to become a FABRIC Project Lead (PL). A PL can create new projects and invite other experimenters into those projects, thus this role comes with substantial new rights and responsibilities. Becoming a PL is not automatic and involves a human-in-the-loop review by FABRIC staff, so it may take up to 72 hours to get processed.</p><p>In general the PL role is reserved for academic faculty or senior staff at US academic institutions, but not for students or temporary staff. Applications from international partners are handled similarly, but may require additional checks and verifications with FABRIC staff. Some exceptions to these rules are possible on a case-by-case basis and will require that another person with administrative standing (e.g. a department head) at your institution vouches for you in writing.</p><p>Press 'Next' to be directed to a CILogon-hosted enrollment workflow. Once you complete your portion of the workflow, FABRIC staff will be notified and will make a decision. The decision will be communicated to you in the form of an email.</p>"
  },
  "selfEnrollRequest": {
    "id": "self-enroll-modal",
    "title": "FABRIC Self Signup",
    "link": "https://registry-test.cilogon.org/registry/co_petitions/start/coef:558",
    "content": "<p>Dear Experimenter,</p><p>Welcome to FABRIC. We noticed you are not yet registered with FABRIC. In order for you to begin using FABRIC you must go through a 3-step guided enrollment workflow. <b>Clicking the Signup button below will take you to the first step of this process</b>.</p><p><b>If you have already started the enrollment process and are waiting for the approval, please continue to check your email for an approval message.</b> We aim to process enrollment requests within one business day. You will be able to login after receiving this approval.</p><p>Please note: you will <b>always</b> use your institutional credentials to login to FABRIC portal via your institution's Identity Provider - we <b>do not and will never store your password or login information</b>. Any password changes that you go through with your institutional account will also affect how you login to the FABRIC portal.</p>"
  },
  "projectLeadDescription": "Project Lead can create new projects, designate Project Owner(s)  and invite regular members into a project. Faculty or senior staff at universities can request this role.",
  "facilityOperatorDescription": "Facility Operator is a ‘superuser’ allowed to manipulate any project. This role is reserved for FABRIC staff.",
  "sliverKeyLimit": 10,
  "bastionKeyLimit": 10
}
